{
  "runId": "7f3fd446-a03b-4171-8e4f-dbd355732e42",
  "customerId": "pfds",
  "createdAt": "2025-11-22T22:54:31.418Z",
  "documents": [
    {
      "id": "c35e2684-8a9d-4be3-8b17-40e606e827eb",
      "customerId": "pfds",
      "type": "acta",
      "fileUrl": "/Users/ashishpunj/Desktop/mcp-docs/pfds/Acta_Constitutiva_PFDS_SAPI.pdf",
      "extractedAt": "2025-11-22T22:53:44.282Z",
      "extractedPayload": {
        "razon_social": "PFDS, SOCIEDAD ANÓNIMA PROMOTORA DE INVERSIÓN DE CAPITAL VARIABLE",
        "rfc": null,
        "registro_mercantil": null,
        "incorporation_date": "2021-08-30",
        "founding_address": {
          "street": null,
          "ext_number": null,
          "int_number": null,
          "colonia": null,
          "municipio": "Ciudad de México",
          "estado": "Ciudad de México",
          "cp": null,
          "cross_streets": null,
          "country": "MX"
        },
        "legal_representatives": [
          {
            "name": "ASHISH PUNJ",
            "role": "Presidente, Apoderado",
            "has_poder": true,
            "can_sign_contracts": true,
            "poder_scope": [
              "Poder general para pleitos y cobranzas, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
              "Para intentar y desistirse de toda clase de procedimientos, inclusive amparo",
              "Para transigir",
              "Para comprometer en árbitros",
              "Para absolver y articular posiciones",
              "Para recusar",
              "Para hacer cesión de bienes",
              "Para recibir pagos",
              "Para presentar denuncias y querellas en materia penal y para desistirse de ellas cuando lo permita la ley",
              "Facultades para representar a la sociedad, en la celebración de convenios y acuerdos necesarios para poder participar en la etapa de conciliación, en los procedimientos orales contemplados en el Código de Procedimientos Civiles para el Distrito Federal y Código de Comercio, pudiendo al efecto pactar todo lo necesario para celebrar los referidos actos y participar en dichas diligencias",
              "Poder general para pleitos y cobranzas y actos de administración en materia laboral, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
              "Poder general para actos de administración",
              "Poder general para actos de dominio",
              "Poder para otorgar y suscribir títulos de crédito",
              "Poder para abrir y cancelar cuentas bancarias y librar cheques contra las mismas",
              "Poder para otorgar poderes generales o especiales así como para delegarlos total o parcialmente e inclusive delegar esta facultad y revocar poderes"
            ],
            "joint_signature_required": true
          },
          {
            "name": "MOISES GABRIEL GONZALEZ RANGEL",
            "role": "Secretario",
            "has_poder": null,
            "can_sign_contracts": false,
            "poder_scope": null,
            "joint_signature_required": null
          },
          {
            "name": "LUCAS JOHN INTRONE",
            "role": "Vocal, Apoderado",
            "has_poder": true,
            "can_sign_contracts": true,
            "poder_scope": [
              "Poder general para pleitos y cobranzas, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
              "Para intentar y desistirse de toda clase de procedimientos, inclusive amparo",
              "Para transigir",
              "Para comprometer en árbitros",
              "Para absolver y articular posiciones",
              "Para recusar",
              "Para hacer cesión de bienes",
              "Para recibir pagos",
              "Para presentar denuncias y querellas en materia penal y para desistirse de ellas cuando lo permita la ley",
              "Facultades para representar a la sociedad, en la celebración de convenios y acuerdos necesarios para poder participar en la etapa de conciliación, en los procedimientos orales contemplados en el Código de Procedimientos Civiles para el Distrito Federal y Código de Comercio, pudiendo al efecto pactar todo lo necesario para celebrar los referidos actos y participar en dichas diligencias",
              "Poder general para pleitos y cobranzas y actos de administración en materia laboral, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
              "Poder general para actos de administración",
              "Poder general para actos de dominio",
              "Poder para otorgar y suscribir títulos de crédito",
              "Poder para abrir y cancelar cuentas bancarias y librar cheques contra las mismas",
              "Poder para otorgar poderes generales o especiales así como para delegarlos total o parcialmente e inclusive delegar esta facultad y revocar poderes"
            ],
            "joint_signature_required": true
          },
          {
            "name": "ARTURO DE LA PEÑA LOREDO",
            "role": "Apoderado",
            "has_poder": true,
            "can_sign_contracts": true,
            "poder_scope": [
              "Poder general para pleitos y cobranzas, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial, pero sin que se comprenda la facultad de hacer cesión de bienes",
              "Para intentar y desistirse de toda clase de procedimientos, inclusive amparo",
              "Para transigir",
              "Para comprometer en árbitros",
              "Para absolver y articular posiciones",
              "Para recusar",
              "Para recibir pagos",
              "Para presentar denuncias y querellas en materia penal y para desistirse de ellas cuando lo permita la ley",
              "Facultades para representar a la sociedad, en la celebración de convenios y acuerdos necesarios para poder participar en la etapa de conciliación, en los procedimientos orales contemplados en el Código de Procedimientos Civiles para el Distrito Federal y Código de Comercio, pudiendo al efecto pactar todo lo necesario para celebrar los referidos actos y participar en dichas diligencias",
              "Poder especial para que en nombre y representación de la sociedad, lleve a cabo todos los trámites y gestiones que sean necesarios ante las dependencias o entidades de la Administración Pública Federal Centralizada o Paraestatal, así como ante las Dependencias y Entidades de la Administración Pública del Gobierno de la Ciudad de México, con el objeto de recibir y recoger documentos, presentar solicitudes y liquidaciones, solicitar la expedición de constancias y documentos, proporcionar la información relacionada con la identidad de la sociedad y su domicilio, realizar cualquier tipo de pagos incluso recargos y multas, pudiendo al efecto recibir notificaciones, ofrecer y rendir pruebas y firmar toda clase de documentación que sea necesaria, ya sea pública o privada",
              "Poder general para actos de administración, en términos del segundo párrafo del artículo dos mil quinientos cincuenta y cuatro del Código Civil para el Distrito Federal y su correlativo de los demás Códigos Civiles de los Estados de la República Mexicana y del Código Civil Federal, limitado única y exclusivamente para que el apoderado en nombre y representación de la sociedad, tramite ante la Secretaria de Hacienda y Crédito Público las solicitudes y avisos ante el Registro Federal de Contribuyentes, a que se refiere el Código Fiscal de la Federación y su reglamento, presente declaraciones, expida constancias y documentos, presente declaraciones de pago provisional, proporcione la información relacionada con su identidad, su domicilio y en general sobre su situación fiscal, entregue pagos, tales como recargos y multas, reclame la devolución del pago indebido de impuestos, derechos y cualquier otro tipo de contribuciones, reciba cheques por concepto de devolución del pago indebido de impuestos, derechos y cualquier otro tipo de contribuciones, reciba notificaciones, ofrezca y rinda pruebas, así como para presentar promociones y recibir la reposición de la cédula de identificación fiscal o cuantos documentos sean necesarios así como llevar a cabo la tramitación, gestión y obtención de la Firma Electrónica Avanzada de la sociedad ante el Servicio de Administración Tributaria"
            ],
            "joint_signature_required": false
          }
        ],
        "shareholders": [
          {
            "name": "ASHISH PUNJ",
            "shares": 94,
            "percentage": 92.16,
            "class": "Serie Uno",
            "is_beneficial_owner": true
          },
          {
            "name": "LUCAS JOHN INTRONE",
            "shares": 6,
            "percentage": 5.88,
            "class": "Serie Uno",
            "is_beneficial_owner": false
          },
          {
            "name": "JOSE RODOLFO CERDAN LEON",
            "shares": 1,
            "percentage": 0.98,
            "class": "Serie Tres",
            "is_beneficial_owner": true
          },
          {
            "name": "MOISES GABRIEL GONZALEZ RANGEL",
            "shares": 1,
            "percentage": 0.98,
            "class": "Serie Tres",
            "is_beneficial_owner": true
          }
        ],
        "corporate_purpose": [
          "La comercialización de toda clase de productos, mediante plataformas electrónicas o cualquier otro medio digital.",
          "La comercialización, distribución, producción, fabricación, importación y exportación, de toda clase de productos, así como la prestación de toda clase de servicios de logística, a cualquier persona física o moral de naturaleza privada o pública.",
          "Prestar y recibir toda clase de servicios a empresas y entidades gubernamentales en la República Mexicana o en el Extranjero a los clientes de la Sociedad, llevando a cabo el estudio, desarrollo e integración de todo tipo de planes, programas, métodos y sistemas de asesoría.",
          "Llevar a cabo por cuenta propia o de terceros programas de capacitación y desarrollo, así como investigaciones científicas para desarrollo tecnológico o investigaciones profesionales, en las materias que requieran las personas físicas o morales a las que la sociedad preste servicios, o a las que la propia sociedad considere conveniente, ya sea directamente o por medio de Institutos Tecnológicos y Universitarios o empresas o instituciones especializadas en el País o en el Extranjero o mediante asociación con dichos institutos, universidades, empresas o instituciones especializadas y proporcionar a sus clientes los resultados de dicha investigación.",
          "Obtener, adquirir, registrar, utilizar o disponer de toda clase de patentes, marcas industriales y de servicio, certificados de invención o nombres comerciales, diseños y dibujos industriales, derechos de autor y cualquier otro tipo de derechos de propiedad industrial, literaria o artística, y derechos sobre ellos ya sea en México o en el extranjero.",
          "Obtener por cualquier título, concesiones, permisos, autorizaciones o licencias, así como celebrar cualquier clase de contratos, con la administración pública sea federal o local o con cualquier particular.",
          "Dar o tomar dinero en préstamo con o sin garantia, emitir bonos, obligaciones, valores y otros títulos de crédito, así como adquirir legalmente y negociar con bonos, obligaciones, acciones, valores y otros títulos de crédito emitidos por terceros.",
          "Otorgar avales y obligarse solidariamente, así como constituir garantías a favor de terceros.",
          "Formar parte directa o indirectamente de otras sociedades o asociaciones e intervenir en todos los asuntos y derechos relacionados con ellas.",
          "Establecer sucursales, oficinas, subsidiarias y agencias, así como representar o ser agente de empresas e intermediar en la venta de toda clase de bienes y servicios.",
          "Adquirir o poseer por cualquier título, usar, dar o tomar en arrendamiento, administrar, vender o disponer en cualquier forma, de todos los bienes muebles o inmuebles, así como derechos reales o personales sobre ellos, que fueren necesarios o convenientes para la realización del objeto de la sociedad.",
          "Contratar al personal necesario para cumplir con su objeto social.",
          "En general celebrar toda clase de contratos ya sean civiles, mercantiles o de cualquier naturaleza."
        ],
        "notary": {
          "name": "MAURICIO GÁLVEZ MUÑOZ",
          "notary_number": "39",
          "protocol_number": "96053",
          "protocol_date": "2021-08-30",
          "office_location": "Ciudad de México"
        },
        "registry": {
          "fme": null,
          "nci": null,
          "unique_doc_number": null,
          "registration_city": null,
          "registration_date": null,
          "folio": null
        },
        "governance": {
          "board_type": "Consejo de Administración",
          "quorum_rules": "Asamblea General Ordinaria: al menos 50% del capital social con derecho a voto. Resoluciones por mayoría de votos presentes. Asamblea General Extraordinaria: al menos 75% del capital social con derecho a voto. Resoluciones por el voto del 51% del capital social con derecho a voto. Resoluciones adoptadas fuera de asamblea por unanimidad de votos son válidas si son confirmadas por escrito.",
          "voting_rights": "Accionistas propietarios de acciones Serie Uno designarán 60% de los miembros del Consejo de Administración; 40% restante por accionistas de otras series por mayoría de votos. Derecho a nombrar comisario: 10% de acciones con derecho a voto. Derecho a solicitar asamblea o aplazar votación: 10% del capital social. Derecho a ejercer acción de responsabilidad civil contra administrador: 15% del capital social. Derecho a oponerse judicialmente a resoluciones de asamblea: 20% del capital social.",
          "share_transfer_rules": "Restricción General: Prohibido vender, transferir, donar, ceder, pignorar, gravar o enajenar acciones, salvo Transmisiones Permitidas y reconocimiento de términos. Transmisiones Permitidas: a Afiliadas, ascendientes y descendientes, o terceros con autorización previa y escrita de todos los accionistas. Las Transmisiones Permitidas sujetas a condición resolutoria. Derecho de Preferencia para adquirir acciones en caso de venta a terceros. Derecho de 'Tag Along' para participar en venta a terceros. Derecho de 'Drag Along' para requerir a otros accionistas vender si un grupo posee 50% o más.",
          "capital_rules": "Capital social variable. Capital mínimo fijo de DIEZ MIL PESOS (10,000 MXN) representado por CIEN acciones ordinarias, nominativas, valor nominal CIEN PESOS cada una. Parte variable del capital sin límite, representado por acciones ordinarias, nominativas, valor nominal CIEN PESOS cada una. La sociedad tendrá tres Series de acciones: Serie Uno (capital fijo), Serie Dos (capital variable), Serie Tres (preferentes sin derecho a voto, capital variable). Aumentos o disminuciones de capital por resolución de asamblea general extraordinaria de accionistas. Derecho preferente para suscribir nuevas acciones. Reducción de capital por reembolso a accionistas o amortización de acciones."
        },
        "modifications": null
      },
      "sourceName": "Acta_Constitutiva_PFDS_SAPI.pdf"
    },
    {
      "id": "9b4acb4b-130f-48ff-a359-90894ded8c5f",
      "customerId": "pfds",
      "type": "sat_constancia",
      "fileUrl": "/Users/ashishpunj/Desktop/mcp-docs/pfds/Constancia_PFDS.pdf",
      "extractedAt": "2025-11-22T22:53:56.913Z",
      "extractedPayload": {
        "rfc": "PFD210830KQ7",
        "razon_social": "PFDS",
        "commercial_name": "PFDS",
        "capital_regime": "SOCIEDAD ANONIMA PROMOTORA DE INVERSION DE CAPITAL VARIABLE",
        "tax_regime": "Régimen General de Ley Personas Morales",
        "start_of_operations": "2021-08-30",
        "status": "ACTIVO",
        "last_status_change": "2021-08-30",
        "issue": {
          "place_municipio": "MIGUEL HIDALGO",
          "place_estado": "CIUDAD DE MEXICO",
          "issue_date": "2025-10-14"
        },
        "fiscal_address": {
          "street": "CALLE GUTENBERG",
          "ext_number": "60",
          "int_number": "6",
          "colonia": "VERONICA ANZURES",
          "municipio": "MIGUEL HIDALGO",
          "estado": "CIUDAD DE MEXICO",
          "cp": "11300",
          "cross_streets": "CIRCUITO INTERIOR MELCHOR OCAMPO Y CALLE HERODOTO",
          "country": "MX"
        },
        "economic_activities": [
          {
            "order": 1,
            "description": "Servicios de mensajería y paquetería local",
            "percentage": 60,
            "start_date": "2021-08-30",
            "end_date": null
          },
          {
            "order": 2,
            "description": "Servicios de consultoría en computación",
            "percentage": 40,
            "start_date": "2024-06-01",
            "end_date": null
          }
        ],
        "tax_obligations": [
          {
            "description": "Pago definitivo mensual de IVA.",
            "due_rule": "A más tardar el día 17 del mes inmediato posterior al periodo que corresponda.",
            "start_date": "2021-08-30",
            "end_date": null
          },
          {
            "description": "Declaración anual de ISR del ejercicio Personas morales.",
            "due_rule": "Dentro de los tres meses siguientes al cierre del ejercicio.",
            "start_date": "2021-08-30",
            "end_date": null
          },
          {
            "description": "Declaración de proveedores de IVA",
            "due_rule": "A más tardar el último día del mes inmediato posterior al periodo que corresponda.",
            "start_date": "2021-08-30",
            "end_date": null
          },
          {
            "description": "Pago provisional mensual de ISR personas morales régimen general",
            "due_rule": "A más tardar el día 17 del mes inmediato posterior al periodo que corresponda.",
            "start_date": "2022-04-01",
            "end_date": null
          },
          {
            "description": "Entero de retenciones mensuales de ISR por sueldos y salarios",
            "due_rule": "A más tardar el día 17 del mes inmediato posterior al periodo que corresponda.",
            "start_date": "2024-06-01",
            "end_date": null
          }
        ]
      },
      "sourceName": "Constancia_PFDS.pdf"
    },
    {
      "id": "644fd736-9d20-423b-a9c7-a40df5503ae6",
      "customerId": "pfds",
      "type": "fm2",
      "fileUrl": "/Users/ashishpunj/Desktop/mcp-docs/pfds/FM2 (1).pdf",
      "extractedAt": "2025-11-22T22:54:05.604Z",
      "extractedPayload": {
        "full_name": "Ashish Punj",
        "nationality": "India",
        "document_type": "Residente Permanente",
        "document_number": "10495074",
        "secondary_number": "0000000445543",
        "date_of_birth": "1975-03-16",
        "curp": "PUXA750316HNENXS02",
        "sex": "Hombre",
        "issue_date": "2014-05-15",
        "expiry_date": null,
        "issuing_office": "Delegación Federal en Distrito Federal",
        "issuer_country": "MX"
      },
      "sourceName": "FM2 (1).pdf"
    },
    {
      "id": "a2a7273f-5925-46b0-9e87-295497b9b8bd",
      "customerId": "pfds",
      "type": "telmex",
      "fileUrl": "/Users/ashishpunj/Desktop/mcp-docs/pfds/Recibo-Oct (2).pdf",
      "extractedAt": "2025-11-22T22:54:19.493Z",
      "extractedPayload": {
        "document_type": "telmex_bill",
        "evidence_meta": {
          "issuer_country": "MX",
          "original_filename": "Recibo-Oct (2).pdf",
          "pages": 4
        },
        "client_name": null,
        "client_address": {
          "street": "CLL GUTENBERG",
          "ext_number": "60",
          "int_number": null,
          "colonia": "VERONICA ANZURES",
          "municipio": "CIUDAD DE MEXICO",
          "estado": "CIUDAD DE MEXICO",
          "cp": "11300",
          "cross_streets": "HERODOTO Y CIRCUITO INT",
          "country": "MX"
        },
        "client_tax_id": "PFD210830KQ7",
        "vendor_name": "TELEFONOS DE MEXICO S.A.B. DE C.V.",
        "vendor_address": {
          "street": "Parque Via",
          "ext_number": "198",
          "int_number": null,
          "colonia": "Cuauhtémoc",
          "municipio": "Ciudad de México",
          "estado": "Ciudad de México",
          "cp": "06500",
          "cross_streets": null,
          "country": "MX"
        },
        "vendor_tax_id": "TME840315-KT6",
        "total_due": 1198,
        "currency": "MXN",
        "due_date": "2025-11-05",
        "billing_month": "Octubre",
        "billing_period_start": "2025-09-01",
        "billing_period_end": "2025-09-30",
        "issue_datetime": "2025-10-15T05:18:05",
        "previous_balance": 1198,
        "current_charges": 598.99,
        "service": {
          "category": "telecom",
          "telephone_number": "5552607741",
          "service_number": "5552607741"
        },
        "account_reference": "5552607741",
        "invoice_number": "070125100071838"
      },
      "sourceName": "Recibo-Oct (2).pdf"
    },
    {
      "id": "98bf1c5c-edd6-4733-928a-e72a9c86ff49",
      "customerId": "pfds",
      "type": "bank_identity_page",
      "fileUrl": "/Users/ashishpunj/Desktop/mcp-docs/pfds/Esatdo_De_Cuenta_Octubre_2025.pdf",
      "extractedAt": "2025-11-22T22:54:31.415Z",
      "extractedPayload": {
        "bank_name": "kapital",
        "account_holder_name": "PFDS",
        "account_number": "001-84119-001-3",
        "clabe": "128180018411900130",
        "currency": "MXN",
        "statement_period_start": "2025-10-01",
        "statement_period_end": "2025-10-31",
        "address_on_statement": {
          "street": "CALLE GUTENBERG",
          "ext_number": "60",
          "int_number": null,
          "colonia": "VERONICA ANZURES",
          "municipio": "MIGUEL HIDALGO",
          "estado": "CIUDAD DE MEXICO",
          "cp": "11300",
          "cross_streets": null,
          "country": "MX"
        }
      },
      "sourceName": "Esatdo_De_Cuenta_Octubre_2025.pdf"
    }
  ],
  "profile": {
    "customerId": "pfds",
    "addressEvidence": [
      {
        "document_type": "telmex_bill",
        "evidence_meta": {
          "issuer_country": "MX",
          "original_filename": "Recibo-Oct (2).pdf",
          "pages": 4
        },
        "client_name": null,
        "client_address": {
          "street": "CLL GUTENBERG",
          "ext_number": "60",
          "int_number": null,
          "colonia": "VERONICA ANZURES",
          "municipio": "CIUDAD DE MEXICO",
          "estado": "CIUDAD DE MEXICO",
          "cp": "11300",
          "cross_streets": "HERODOTO Y CIRCUITO INT",
          "country": "MX"
        },
        "client_tax_id": "PFD210830KQ7",
        "vendor_name": "TELEFONOS DE MEXICO S.A.B. DE C.V.",
        "vendor_address": {
          "street": "Parque Via",
          "ext_number": "198",
          "int_number": null,
          "colonia": "Cuauhtémoc",
          "municipio": "Ciudad de México",
          "estado": "Ciudad de México",
          "cp": "06500",
          "cross_streets": null,
          "country": "MX"
        },
        "vendor_tax_id": "TME840315-KT6",
        "total_due": 1198,
        "currency": "MXN",
        "due_date": "2025-11-05",
        "billing_month": "Octubre",
        "billing_period_start": "2025-09-01",
        "billing_period_end": "2025-09-30",
        "issue_datetime": "2025-10-15T05:18:05",
        "previous_balance": 1198,
        "current_charges": 598.99,
        "service": {
          "category": "telecom",
          "telephone_number": "5552607741",
          "service_number": "5552607741"
        },
        "account_reference": "5552607741",
        "invoice_number": "070125100071838"
      }
    ],
    "bankAccounts": [],
    "historical_addresses": [
      {
        "source": "acta",
        "address": {
          "street": null,
          "ext_number": null,
          "int_number": null,
          "colonia": null,
          "municipio": "Ciudad de México",
          "estado": "Ciudad de México",
          "cp": null,
          "cross_streets": null,
          "country": "MX"
        },
        "date": "2021-08-30"
      },
      {
        "source": "sat",
        "address": {
          "street": "CALLE GUTENBERG",
          "ext_number": "60",
          "int_number": "6",
          "colonia": "VERONICA ANZURES",
          "municipio": "MIGUEL HIDALGO",
          "estado": "CIUDAD DE MEXICO",
          "cp": "11300",
          "cross_streets": "CIRCUITO INTERIOR MELCHOR OCAMPO Y CALLE HERODOTO",
          "country": "MX"
        },
        "date": "2025-10-14"
      },
      {
        "source": "proof_of_address",
        "address": {
          "street": "CLL GUTENBERG",
          "ext_number": "60",
          "int_number": null,
          "colonia": "VERONICA ANZURES",
          "municipio": "CIUDAD DE MEXICO",
          "estado": "CIUDAD DE MEXICO",
          "cp": "11300",
          "cross_streets": "HERODOTO Y CIRCUITO INT",
          "country": "MX"
        },
        "date": "2025-10-15T05:18:05"
      }
    ],
    "lastUpdatedAt": "2025-11-22T22:54:31.416Z",
    "companyIdentity": {
      "razon_social": "PFDS, SOCIEDAD ANÓNIMA PROMOTORA DE INVERSIÓN DE CAPITAL VARIABLE",
      "rfc": null,
      "registro_mercantil": null,
      "incorporation_date": "2021-08-30",
      "founding_address": {
        "street": null,
        "ext_number": null,
        "int_number": null,
        "colonia": null,
        "municipio": "Ciudad de México",
        "estado": "Ciudad de México",
        "cp": null,
        "cross_streets": null,
        "country": "MX"
      },
      "legal_representatives": [
        {
          "name": "ASHISH PUNJ",
          "role": "Presidente, Apoderado",
          "has_poder": true,
          "can_sign_contracts": true,
          "poder_scope": [
            "Poder general para pleitos y cobranzas, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
            "Para intentar y desistirse de toda clase de procedimientos, inclusive amparo",
            "Para transigir",
            "Para comprometer en árbitros",
            "Para absolver y articular posiciones",
            "Para recusar",
            "Para hacer cesión de bienes",
            "Para recibir pagos",
            "Para presentar denuncias y querellas en materia penal y para desistirse de ellas cuando lo permita la ley",
            "Facultades para representar a la sociedad, en la celebración de convenios y acuerdos necesarios para poder participar en la etapa de conciliación, en los procedimientos orales contemplados en el Código de Procedimientos Civiles para el Distrito Federal y Código de Comercio, pudiendo al efecto pactar todo lo necesario para celebrar los referidos actos y participar en dichas diligencias",
            "Poder general para pleitos y cobranzas y actos de administración en materia laboral, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
            "Poder general para actos de administración",
            "Poder general para actos de dominio",
            "Poder para otorgar y suscribir títulos de crédito",
            "Poder para abrir y cancelar cuentas bancarias y librar cheques contra las mismas",
            "Poder para otorgar poderes generales o especiales así como para delegarlos total o parcialmente e inclusive delegar esta facultad y revocar poderes"
          ],
          "joint_signature_required": true
        },
        {
          "name": "MOISES GABRIEL GONZALEZ RANGEL",
          "role": "Secretario",
          "has_poder": null,
          "can_sign_contracts": false,
          "poder_scope": null,
          "joint_signature_required": null
        },
        {
          "name": "LUCAS JOHN INTRONE",
          "role": "Vocal, Apoderado",
          "has_poder": true,
          "can_sign_contracts": true,
          "poder_scope": [
            "Poder general para pleitos y cobranzas, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
            "Para intentar y desistirse de toda clase de procedimientos, inclusive amparo",
            "Para transigir",
            "Para comprometer en árbitros",
            "Para absolver y articular posiciones",
            "Para recusar",
            "Para hacer cesión de bienes",
            "Para recibir pagos",
            "Para presentar denuncias y querellas en materia penal y para desistirse de ellas cuando lo permita la ley",
            "Facultades para representar a la sociedad, en la celebración de convenios y acuerdos necesarios para poder participar en la etapa de conciliación, en los procedimientos orales contemplados en el Código de Procedimientos Civiles para el Distrito Federal y Código de Comercio, pudiendo al efecto pactar todo lo necesario para celebrar los referidos actos y participar en dichas diligencias",
            "Poder general para pleitos y cobranzas y actos de administración en materia laboral, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial",
            "Poder general para actos de administración",
            "Poder general para actos de dominio",
            "Poder para otorgar y suscribir títulos de crédito",
            "Poder para abrir y cancelar cuentas bancarias y librar cheques contra las mismas",
            "Poder para otorgar poderes generales o especiales así como para delegarlos total o parcialmente e inclusive delegar esta facultad y revocar poderes"
          ],
          "joint_signature_required": true
        },
        {
          "name": "ARTURO DE LA PEÑA LOREDO",
          "role": "Apoderado",
          "has_poder": true,
          "can_sign_contracts": true,
          "poder_scope": [
            "Poder general para pleitos y cobranzas, con todas las facultades generales y aún con las especiales que de acuerdo con la ley requieran poder o cláusula especial, pero sin que se comprenda la facultad de hacer cesión de bienes",
            "Para intentar y desistirse de toda clase de procedimientos, inclusive amparo",
            "Para transigir",
            "Para comprometer en árbitros",
            "Para absolver y articular posiciones",
            "Para recusar",
            "Para recibir pagos",
            "Para presentar denuncias y querellas en materia penal y para desistirse de ellas cuando lo permita la ley",
            "Facultades para representar a la sociedad, en la celebración de convenios y acuerdos necesarios para poder participar en la etapa de conciliación, en los procedimientos orales contemplados en el Código de Procedimientos Civiles para el Distrito Federal y Código de Comercio, pudiendo al efecto pactar todo lo necesario para celebrar los referidos actos y participar en dichas diligencias",
            "Poder especial para que en nombre y representación de la sociedad, lleve a cabo todos los trámites y gestiones que sean necesarios ante las dependencias o entidades de la Administración Pública Federal Centralizada o Paraestatal, así como ante las Dependencias y Entidades de la Administración Pública del Gobierno de la Ciudad de México, con el objeto de recibir y recoger documentos, presentar solicitudes y liquidaciones, solicitar la expedición de constancias y documentos, proporcionar la información relacionada con la identidad de la sociedad y su domicilio, realizar cualquier tipo de pagos incluso recargos y multas, pudiendo al efecto recibir notificaciones, ofrecer y rendir pruebas y firmar toda clase de documentación que sea necesaria, ya sea pública o privada",
            "Poder general para actos de administración, en términos del segundo párrafo del artículo dos mil quinientos cincuenta y cuatro del Código Civil para el Distrito Federal y su correlativo de los demás Códigos Civiles de los Estados de la República Mexicana y del Código Civil Federal, limitado única y exclusivamente para que el apoderado en nombre y representación de la sociedad, tramite ante la Secretaria de Hacienda y Crédito Público las solicitudes y avisos ante el Registro Federal de Contribuyentes, a que se refiere el Código Fiscal de la Federación y su reglamento, presente declaraciones, expida constancias y documentos, presente declaraciones de pago provisional, proporcione la información relacionada con su identidad, su domicilio y en general sobre su situación fiscal, entregue pagos, tales como recargos y multas, reclame la devolución del pago indebido de impuestos, derechos y cualquier otro tipo de contribuciones, reciba cheques por concepto de devolución del pago indebido de impuestos, derechos y cualquier otro tipo de contribuciones, reciba notificaciones, ofrezca y rinda pruebas, así como para presentar promociones y recibir la reposición de la cédula de identificación fiscal o cuantos documentos sean necesarios así como llevar a cabo la tramitación, gestión y obtención de la Firma Electrónica Avanzada de la sociedad ante el Servicio de Administración Tributaria"
          ],
          "joint_signature_required": false
        }
      ],
      "shareholders": [
        {
          "name": "ASHISH PUNJ",
          "shares": 94,
          "percentage": 92.16,
          "class": "Serie Uno",
          "is_beneficial_owner": true
        },
        {
          "name": "LUCAS JOHN INTRONE",
          "shares": 6,
          "percentage": 5.88,
          "class": "Serie Uno",
          "is_beneficial_owner": false
        },
        {
          "name": "JOSE RODOLFO CERDAN LEON",
          "shares": 1,
          "percentage": 0.98,
          "class": "Serie Tres",
          "is_beneficial_owner": true
        },
        {
          "name": "MOISES GABRIEL GONZALEZ RANGEL",
          "shares": 1,
          "percentage": 0.98,
          "class": "Serie Tres",
          "is_beneficial_owner": true
        }
      ],
      "corporate_purpose": [
        "La comercialización de toda clase de productos, mediante plataformas electrónicas o cualquier otro medio digital.",
        "La comercialización, distribución, producción, fabricación, importación y exportación, de toda clase de productos, así como la prestación de toda clase de servicios de logística, a cualquier persona física o moral de naturaleza privada o pública.",
        "Prestar y recibir toda clase de servicios a empresas y entidades gubernamentales en la República Mexicana o en el Extranjero a los clientes de la Sociedad, llevando a cabo el estudio, desarrollo e integración de todo tipo de planes, programas, métodos y sistemas de asesoría.",
        "Llevar a cabo por cuenta propia o de terceros programas de capacitación y desarrollo, así como investigaciones científicas para desarrollo tecnológico o investigaciones profesionales, en las materias que requieran las personas físicas o morales a las que la sociedad preste servicios, o a las que la propia sociedad considere conveniente, ya sea directamente o por medio de Institutos Tecnológicos y Universitarios o empresas o instituciones especializadas en el País o en el Extranjero o mediante asociación con dichos institutos, universidades, empresas o instituciones especializadas y proporcionar a sus clientes los resultados de dicha investigación.",
        "Obtener, adquirir, registrar, utilizar o disponer de toda clase de patentes, marcas industriales y de servicio, certificados de invención o nombres comerciales, diseños y dibujos industriales, derechos de autor y cualquier otro tipo de derechos de propiedad industrial, literaria o artística, y derechos sobre ellos ya sea en México o en el extranjero.",
        "Obtener por cualquier título, concesiones, permisos, autorizaciones o licencias, así como celebrar cualquier clase de contratos, con la administración pública sea federal o local o con cualquier particular.",
        "Dar o tomar dinero en préstamo con o sin garantia, emitir bonos, obligaciones, valores y otros títulos de crédito, así como adquirir legalmente y negociar con bonos, obligaciones, acciones, valores y otros títulos de crédito emitidos por terceros.",
        "Otorgar avales y obligarse solidariamente, así como constituir garantías a favor de terceros.",
        "Formar parte directa o indirectamente de otras sociedades o asociaciones e intervenir en todos los asuntos y derechos relacionados con ellas.",
        "Establecer sucursales, oficinas, subsidiarias y agencias, así como representar o ser agente de empresas e intermediar en la venta de toda clase de bienes y servicios.",
        "Adquirir o poseer por cualquier título, usar, dar o tomar en arrendamiento, administrar, vender o disponer en cualquier forma, de todos los bienes muebles o inmuebles, así como derechos reales o personales sobre ellos, que fueren necesarios o convenientes para la realización del objeto de la sociedad.",
        "Contratar al personal necesario para cumplir con su objeto social.",
        "En general celebrar toda clase de contratos ya sean civiles, mercantiles o de cualquier naturaleza."
      ],
      "notary": {
        "name": "MAURICIO GÁLVEZ MUÑOZ",
        "notary_number": "39",
        "protocol_number": "96053",
        "protocol_date": "2021-08-30",
        "office_location": "Ciudad de México"
      },
      "registry": {
        "fme": null,
        "nci": null,
        "unique_doc_number": null,
        "registration_city": null,
        "registration_date": null,
        "folio": null
      },
      "governance": {
        "board_type": "Consejo de Administración",
        "quorum_rules": "Asamblea General Ordinaria: al menos 50% del capital social con derecho a voto. Resoluciones por mayoría de votos presentes. Asamblea General Extraordinaria: al menos 75% del capital social con derecho a voto. Resoluciones por el voto del 51% del capital social con derecho a voto. Resoluciones adoptadas fuera de asamblea por unanimidad de votos son válidas si son confirmadas por escrito.",
        "voting_rights": "Accionistas propietarios de acciones Serie Uno designarán 60% de los miembros del Consejo de Administración; 40% restante por accionistas de otras series por mayoría de votos. Derecho a nombrar comisario: 10% de acciones con derecho a voto. Derecho a solicitar asamblea o aplazar votación: 10% del capital social. Derecho a ejercer acción de responsabilidad civil contra administrador: 15% del capital social. Derecho a oponerse judicialmente a resoluciones de asamblea: 20% del capital social.",
        "share_transfer_rules": "Restricción General: Prohibido vender, transferir, donar, ceder, pignorar, gravar o enajenar acciones, salvo Transmisiones Permitidas y reconocimiento de términos. Transmisiones Permitidas: a Afiliadas, ascendientes y descendientes, o terceros con autorización previa y escrita de todos los accionistas. Las Transmisiones Permitidas sujetas a condición resolutoria. Derecho de Preferencia para adquirir acciones en caso de venta a terceros. Derecho de 'Tag Along' para participar en venta a terceros. Derecho de 'Drag Along' para requerir a otros accionistas vender si un grupo posee 50% o más.",
        "capital_rules": "Capital social variable. Capital mínimo fijo de DIEZ MIL PESOS (10,000 MXN) representado por CIEN acciones ordinarias, nominativas, valor nominal CIEN PESOS cada una. Parte variable del capital sin límite, representado por acciones ordinarias, nominativas, valor nominal CIEN PESOS cada una. La sociedad tendrá tres Series de acciones: Serie Uno (capital fijo), Serie Dos (capital variable), Serie Tres (preferentes sin derecho a voto, capital variable). Aumentos o disminuciones de capital por resolución de asamblea general extraordinaria de accionistas. Derecho preferente para suscribir nuevas acciones. Reducción de capital por reembolso a accionistas o amortización de acciones."
      },
      "modifications": null
    },
    "foundingAddress": {
      "street": null,
      "ext_number": null,
      "int_number": null,
      "colonia": null,
      "municipio": "Ciudad de México",
      "estado": "Ciudad de México",
      "cp": null,
      "cross_streets": null,
      "country": "MX"
    },
    "companyTaxProfile": {
      "rfc": "PFD210830KQ7",
      "razon_social": "PFDS",
      "commercial_name": "PFDS",
      "capital_regime": "SOCIEDAD ANONIMA PROMOTORA DE INVERSION DE CAPITAL VARIABLE",
      "tax_regime": "Régimen General de Ley Personas Morales",
      "start_of_operations": "2021-08-30",
      "status": "ACTIVO",
      "last_status_change": "2021-08-30",
      "issue": {
        "place_municipio": "MIGUEL HIDALGO",
        "place_estado": "CIUDAD DE MEXICO",
        "issue_date": "2025-10-14"
      },
      "fiscal_address": {
        "street": "CALLE GUTENBERG",
        "ext_number": "60",
        "int_number": "6",
        "colonia": "VERONICA ANZURES",
        "municipio": "MIGUEL HIDALGO",
        "estado": "CIUDAD DE MEXICO",
        "cp": "11300",
        "cross_streets": "CIRCUITO INTERIOR MELCHOR OCAMPO Y CALLE HERODOTO",
        "country": "MX"
      },
      "economic_activities": [
        {
          "order": 1,
          "description": "Servicios de mensajería y paquetería local",
          "percentage": 60,
          "start_date": "2021-08-30",
          "end_date": null
        },
        {
          "order": 2,
          "description": "Servicios de consultoría en computación",
          "percentage": 40,
          "start_date": "2024-06-01",
          "end_date": null
        }
      ],
      "tax_obligations": [
        {
          "description": "Pago definitivo mensual de IVA.",
          "due_rule": "A más tardar el día 17 del mes inmediato posterior al periodo que corresponda.",
          "start_date": "2021-08-30",
          "end_date": null
        },
        {
          "description": "Declaración anual de ISR del ejercicio Personas morales.",
          "due_rule": "Dentro de los tres meses siguientes al cierre del ejercicio.",
          "start_date": "2021-08-30",
          "end_date": null
        },
        {
          "description": "Declaración de proveedores de IVA",
          "due_rule": "A más tardar el último día del mes inmediato posterior al periodo que corresponda.",
          "start_date": "2021-08-30",
          "end_date": null
        },
        {
          "description": "Pago provisional mensual de ISR personas morales régimen general",
          "due_rule": "A más tardar el día 17 del mes inmediato posterior al periodo que corresponda.",
          "start_date": "2022-04-01",
          "end_date": null
        },
        {
          "description": "Entero de retenciones mensuales de ISR por sueldos y salarios",
          "due_rule": "A más tardar el día 17 del mes inmediato posterior al periodo que corresponda.",
          "start_date": "2024-06-01",
          "end_date": null
        }
      ]
    },
    "currentFiscalAddress": {
      "street": "CALLE GUTENBERG",
      "ext_number": "60",
      "int_number": "6",
      "colonia": "VERONICA ANZURES",
      "municipio": "MIGUEL HIDALGO",
      "estado": "CIUDAD DE MEXICO",
      "cp": "11300",
      "cross_streets": "CIRCUITO INTERIOR MELCHOR OCAMPO Y CALLE HERODOTO",
      "country": "MX"
    },
    "bankIdentity": {
      "bank_name": "kapital",
      "account_holder_name": "PFDS",
      "clabe": "128180018411900130",
      "clabe_last4": "0130",
      "address_on_file": {
        "street": "CALLE GUTENBERG",
        "ext_number": "60",
        "int_number": null,
        "colonia": "VERONICA ANZURES",
        "municipio": "MIGUEL HIDALGO",
        "estado": "CIUDAD DE MEXICO",
        "cp": "11300",
        "cross_streets": null,
        "country": "MX"
      },
      "document_date": "2025-10-31",
      "age_in_days": 22,
      "within_90_days": true,
      "holder_matches_company": true,
      "address_matches_operational": true
    },
    "representativeIdentity": {
      "full_name": "Ashish Punj",
      "nationality": "India",
      "document_type": "Residente Permanente",
      "document_number": "10495074",
      "secondary_number": "0000000445543",
      "date_of_birth": "1975-03-16",
      "curp": "PUXA750316HNENXS02",
      "sex": "Hombre",
      "issue_date": "2014-05-15",
      "expiry_date": null,
      "issuing_office": "Delegación Federal en Distrito Federal",
      "issuer_country": "MX"
    },
    "currentOperationalAddress": {
      "street": "CALLE GUTENBERG",
      "ext_number": "60",
      "int_number": null,
      "colonia": "VERONICA ANZURES",
      "municipio": "MIGUEL HIDALGO",
      "estado": "CIUDAD DE MEXICO",
      "cp": "11300",
      "cross_streets": null,
      "country": "MX"
    }
  },
  "validation": {
    "customerId": "pfds",
    "score": 1,
    "flags": [],
    "generatedAt": "2025-11-22T22:54:31.418Z"
  }
}